{
  "content": [
    {
      "date": "2017-05-12",
      "summary": "I started to self-learn back in July 2016. During the first five months (July-Nov), I used to follow the great MIT course [“Introduction to Computer Science and Programming”](https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-00-introduction-to-computer-science-and-programming-fall-2008/). Alongside, I used to read the book [“Learn Python the Hard Way”](https://learnpythonthehardway.org/book/) by *Zed A. Shaw*. Shaw’s book is practical and has about 50 exercises: in the last one you create a simple web-game.\nAfter concluding both the book and the course, I decided to explore different ‘must-do’ languages. In November 2016 I joined the Free Code Camp community to learn basics about Javascript, HTML, CSS and web-development. At the end of January 2017 I obtained their [Front End Certification](https://www.freecodecamp.com/laura-barluzzi/front-end-certification). I highly recommend their front-end exercises and tutorials, I learnt a lot from them!\n In late February 2017, while starting a voting application as part of the back-end exercises, I received a notification from the **Freecodecamp Vancouver Facebook group**: someone posted about a job opening for the Outreachy summer internship program. Was I eligible? Yes. Was it doable for my level? Maybe. After a bit of thinking, I decided to give it a try. For the entire month of March I learned how to use Git and I contributed on the [cadasta-platform](https://github.com/Cadasta/cadasta-platform) by fixing some issues. Understanding code written by other people and spread-out in hundreds of documents was not an easy task. I couldn’t have make it without the help of other developers who answered my questions...\n...my hard-work and self-directive research paid off though – the Cadasta team chose me as their Outreachy 2017 summer intern! Keep up the hard work!",
      "title": "My self-learning path to sofware development",
      "topics": ["Self-learning", "Outreachy"],
      "type": "Post",
      "url": ""
    },
    {
      "date": "2017-05-16",
      "summary": "I grew up in a small Alpine Italian city called Belluno. Since I was a teenager, I started volunteering at a local fairtrade shop and I became ‘famous’ among my peers for my dedication to social causes. Although I was studying accounting and programming (I know, funny), my interests in human rights and global justice brought me to pursue international development studies. For about 10 years, *my dream was to work for NGOs*, co-operatives and enterprises that promote social justice.\nIn November 2015 I obtained my Master and the job hunting phase in international development began. Over a period of 7-8 months I applied to a couple of hundreds of openings all over the world. I’d say I wrote *thousands* of lines in motivation letters and many pre-structured application forms. However, I received *only one answer: _a rejection_*. What a bummer! In Vancouver at least I obtained an opportunity at the _British Columbia Council for International Development (BCCIC)_. Although the internship went great, their budget and hands were tied so they had to let me go.\nIt was in July 2016 that I realized two things: (1) I was *not really specialized* in anything; and (2) A *safe paid career was not going to happen* in international development. With a sour taste in my mouth, I convinced myself to purse a *plan B*. But was this a defeat? I actually then realized that defeat would have been to keep going based on a [sunk cost fallacy](https://youarenotsosmart.com/2011/03/25/the-sunk-cost-fallacy/).\nAs a consequnce, for 9-months I have been self-learning programming, and today I’m about to start an internship as a software developer at Cadasta. Cadasta enables people in developing countries to better protect and manage their land rights -- ironically, my plan B is enabling my plan A... life is funny, isn't it?",
      "title": "Changing career empowered me",
      "topics": ["Career"],
      "type": "Post",
      "url": ""
    },   
    {
      "date": "2017-06-16",
      "summary": "My first weeks as an Outreachy intern at [Cadasta](https://github.com/Cadasta) have been incredible. As agreed with my mentors Chandra and Kate, my starting task was to enhance the user experience by adding the **language option in the user account**. The result of this work in available on [this PR](https://github.com/Cadasta/cadasta-platform/pull/1569) on Github. As you can see, Cadasta uses Python with Django.\nTo achieve the goal, on my first day I made a detailed task-list, which you can see on the PR description section. Fortunately, thanks to the fact I have already contributed during the application process, the setting up of the environment and the Git Flow were already known to me. This meant I could quickly start with the tasks. I’m going to write the next paragraphs highlighting *challenges* and **moments of pride** for each chunk of work:\n\n**1. Handling a migration**\n\n**Challenges:**\nIt was the first time I worked with migrations and I didn’t have a clear idea of what it required to do. Following some online tutorials, I just learned how to run commands such as `python manage.py makemigrations` and `python manage.py migrate`. At first I believed this was *all*. Though I encountered a problem and an unclear error appeared -- I was unable to figure it out on my own. After asking for help, I was told the error was linked probably to the version of Python (2.X instead of 3.X). After fixing this problem, later on I also discovered I had to add, commit and push a migration file to Git Hub in order to add the model change to the PR -- another information I didn’t know and I needed help from someone else in order to figure out.\n\n**Moments of pride:**\nI didn’t have one to be honest. But in retrospect I acknowledge the importance of asking for help with detailed information and at the right time. I was unblocked very quickly with the help from other people.\n\n**2. Activating translation of language stored in the user model:**\n\n**Challenges:**\nOne of the biggest challenges I faced was to find detailed information (and understand) the Django documentation over topics such as **Internationalization** and writing **custom middlewares**. Some specific questions on how to activate the language stored in the `user.language` field were not available (or very hard to find) neither in StackOverflow and other websites. Further, the [Django page on custom middlewares](https://docs.djangoproject.com/en/1.11/topics/http/middleware/) was missing key information such as the fact that middlewares should `return None` if not a response.\n\n**Moments of pride:**\nI was delighted when I saw it working at the end: in this tough process I learned a lot and I built for the first time a middleware and a test using the Python unittest module [Mock](https://docs.python.org/3/library/unittest.mock-examples.html).\n\n**3. Adding feature to the API**\n\n**Challenges:**\nAgain the main major block of this task was the lack of detailed cases in the [Cadasta API Documentation](https://cadasta.github.io/api-docs/). One of the reviewers of my PR required this addition by just mentioning it, and unfortunately my mentors were not able to guide me and quickly address my questions on **how to start** with this. For an entire day I was blocked and I could not understand where to find *detailed* information. However, on my second day somebody from the dev team helped me a lot and I could finally figure out everything.\n**Moments of pride:**\nFirstly, I used my experience to improve the existing documentation: I wrote a mock up with **curl command examples** for each section and I shared this document with people in charge of the documentation upgrade -- my initiative was highly appreciated! Secondly, I was proud of myself since I learned a lot: although I needed the initial help to start, I then figured out everything on my own by reading existing code and pages on the [Django Rest Framework](http://www.django-rest-framework.org/).\n\n**Summary**\n\nMy start at Cadasta was incredible since I felt a lot the ownership for my work. Facing challenges such as learning new frameworks or understanding the documentation have ultimately been positive experiences -- this makes me feel more and more like a developer.I guess this is the **magic** of coding at the end of the day:\n\n> **There’ll be always challenges, therefore there’ll be always gratifications and chances to learn.**\n\n-- my own words :)\n\n\n[Cadasta git hub repository](https://github.com/Cadasta/cadasta-platform)\n\n[My first PR](https://github.com/Cadasta/cadasta-platform/pull/1569)\n\n[My koalacoder website](http://koalacoder.com/)\n\n[My blog](http://koalacoder.com/cadasta-blog/)",
      "title": "My first weeks as an intern at Cadasta",
      "topics": ["Outreachy", "Cadasta", "Work"],
      "type": "Post",
      "url": ""
    }
  ],
  
  "styling": {
    "navbarColor": "red lighten-2",
    "backgroundColor": "blue-grey"
  },
  
  "meta": {
    "title": "my coding blog",
    "about": {
      "avatar": "",
      "blurb": "##### Hello World! Welcome to my coding blog!\nI'm a fuzzy   [***koala coder***](http://koalacoder.com) and here I write about my experience as an [Outreachy](https://www.gnome.org/outreachy/) intern at [Cadasta](http://cadasta.org).\nAfter studying politics and international developement, I decided to self-learn programming and I'm excited to share *challenges*, *joys* and *lessons learnt* along the way.\nMy posts highlight the reality of studying and working on **open source, remote and tech-for-good projects.**"
    }
  }
}
